import torch



####################################### item()#####################################################
x = torch.tensor([[1, 2, 3],
                  [4, 5, 6]])
# 对整个张量进行求和
total_sum = torch.sum(x)
print(total_sum.item())  # 输出结果为 21   item()用于将一个标量张量（只有一个元素）转换为Python的标量，以便进行后续的计算或输出

######################################unsqueeze#########################################################
'''unsqueeze 是 PyTorch 中的一个函数，用于增加张量的维度。它可以在指定的维度上增加一个大小为1的维度。有一个形状为 (3, 4) 的张量 x
x = x.unsqueeze(0)x 的形状变为 (1, 3, 4)，其中第一个维度是新加的维度，大小为1'''
x = torch.tensor([[1, 2, 3],
                  [4, 5, 6]])
x = x.unsqueeze(0)
print(x.shape)  # 输出结果为 torch.Size([1, 2, 3])

